app/controllers/api/questions_controller.rb

  def index
    event = Event.find_by(id: params[:event_id])
    if event.nil?
      return render json: { message: "Event does not exist." }, status: :not_found
    end

    questions = event.questions
    if questions.empty?
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" INNER JOIN "events_questions" ON "questions"."id" = "events_questions"."question_id" WHERE "events_questions"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "questions" INNER JOIN "events_questions" ON "questions"."id" = "events_questions"."question_id" WHERE "events_questions"."event_id" = ?  [["event_id", 1]]