app/controllers/concerns/event_lookup.rb

  def find_event
    Rails.logger.debug "Received params: #{params.inspect}"
    event = Event.find_by(id: params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" IS NULL LIMIT ?  [["LIMIT", 1]]